[Lightbro_Bless X2AbilityTemplate]
-LocLongDescription="神父向光明低语一段短暂的祷告，为一个盟友祝福一回合。提供25点瞄准、暴击几率、防御和闪避。冷却时间4个回合。"
+LocLongDescription="光之战士向光祈祷，为一名盟友祝福一个回合。提供10点瞄准、暴击机会、防御和闪避的加成。冷却时间4个回合。"
-LocHelpText="为一名盟友祝福一个回合。提供25点瞄准和暴击机会，以及20点防御和闪避。冷却时间4个回合。"
+LocHelpText="为一名盟友祝福一个回合。提供25点瞄准和暴击机会，以及20点防御和闪避。冷却时间4个回合。"

[Lightbro_Conceal X2AbilityTemplate]
-LocLongDescription="牧师能够弯曲光线绕过物体，有效地使其消失在空气中。为目标提供隐蔽。冷却时间4回合。"
+LocLongDescription="光之战士能够将光线弯曲在物体周围，有效地使其消失于空气中。为目标提供隐蔽。冷却时间6回合。"
-LocHelpText="向目标提供隐蔽。冷却时间4回合。"
+LocHelpText="向目标提供隐蔽。冷却时间4回合。"

[Lightbro_Faith X2AbilityTemplate]
-LocLongDescription="圣骑士对光明的最终胜利毫无疑问。他们的信仰带领他们走向荣耀。获得+50暴击几率和+25%闪避加成。"
+LocLongDescription="圣骑士对光明的最终胜利毫无疑问。他们的信仰带领他们走向荣耀。获得+10暴击几率和+10%闪避加成。"
-LocHelpText="Passive: 获得+50暴击几率和+15闪避加成。"
+LocHelpText="Passive: 获得+10暴击几率和+10闪避加成。"

[Lightbro_Consecrate X2AbilityTemplate]
-LocLongDescription="光之战士们会在空闲时间里进行祈祷和冥想。你经常会发现他们为所有的装备，包括一颗颗子弹都赐福。这增加了+3的护甲和+25的精度奖励。"
+LocLongDescription="光之战士们会在空闲时间里进行祈祷和冥想。你经常会发现他们为所有的装备，包括一颗颗子弹都赐福。这增加了+3的护甲和+25的精度奖励。"
-LocHelpText="被动，+3护甲，+25精度"
+LocHelpText="被动，+3护甲，+25精度"

[Lightbro_minor_Heal X2AbilityTemplate]
-LocLongDescription="通过这个最简单的咒语，光之战士每回合可以恢复1点生命值。施放此咒语不会结束你的回合。"
+LocLongDescription="通过这个最简单的咒语，光之战士每回合可以恢复1点生命值。施放此咒语不会结束你的回合。"
